<?php
$start = $_REQUEST['start'];
$end = $_REQUEST['end'];
$step = $_REQUEST['step'];
$array = [
    "Добавим к этому числу немножко магии и... готово!",
    "Это как добавить одну ложку сахара к чаю – только с числами!",
    "А теперь маленький шаг для числа, но большой скачок для математики!",
    "Было одно число, стало другое – великая трансформация!",
    "Одно число + ".$step." – и у нас новая вселенная чисел!",
    "Еще один шаг к бесконечности – добавим единичку!",
    "Прибавляем как настоящий математический волшебник!",
    "Это как добавить черный пояс по арифметике!",
    "Еще одно число и мир никогда не будет прежним!",
    "Добавляем как будто строим числовую империю!"
];
echo "Начали с числа ".$start."<br>Прибавляем за каждый шаг ".$step."<br>Закончим числом ".$end."<br><br>Погнали))<br><br>";

while($start < $end) {
    $start_count = $start;
    $end_count = $start_count + $step;
    $start = $end_count;
    $phrase = $array[rand(0,9)];
    echo $phrase."<br><br>";
    echo "Сейчас число равно: ".$end_count."<br><br>";
}
?>
